#+TITLE: Matt Dean's Emacs configuration
#+OPTIONS: toc:4 h:4
#+STARTUP: content

This config is inspired by:

- [[https://github.com/daschwa/emacs.d/blob/master/readme.org][Adam Schwartz's emacs.d]]

**** How to archive subtrees                                           :NOTE:
:LOGBOOK:  
CLOCK: [2014-11-29 Sat 21:23]--[2014-11-29 Sat 21:24] =>  0:01
:END:      
:PROPERTIES:
:ID:       2B1E39DD-7474-406E-9DFC-A3885D6B3D22
:END:
[2014-11-29 Sat 21:23]

Mark all of the entries in the block agenda using the =m= key and then
archive them all to the appropriate place with =B $=. This normally
takes less than 5 minutes once a month.

Archivable tasks show up in the last section of my block agenda when a
new month starts. Any tasks that are done but have no timestamps this
month or last month (ie. they are over 30 days old) are available to
archive. Timestamps include closed dates, notes, clock data, etc - any
active or inactive timestamp in the task.

***** Key bindings in agenda mode for focusing in the org agenda   :NOTE:
:LOGBOOK:  
CLOCK: [2014-12-02 Tue 09:06]--[2014-12-02 Tue 09:13] =>  0:07
:END:      
:PROPERTIES:
:ID:       DE014EAF-BAD1-4D97-BCC7-97BF87A6CE66
:END:
[2014-12-02 Tue 09:06]

- =N= narrows to the current task subtree

  This is the same as =C-c C-x <=

- =U= narrows to the parent subtree of this task

  This goes up one level and narrows to that subtree.

- =P= narrows to the entire project containing this task

  This goes up the tree to the top-level =TODO= keyword and selects
  that as the subtree to narrow to

- =W= removes the restriction, widening the buffer
**** To disable todo blocking for a subtree                            :NOTE:
:LOGBOOK:  
CLOCK: [2014-12-02 Tue 09:24]--[2014-12-02 Tue 09:26] =>  0:02
:END:      
[2014-12-02 Tue 09:24]

Add the following to the subtask:

#+BEGIN_SRC org
:PROPERTIES:
:NOBLOCKING: t
:Effort:   1:00
:ID:       3827B641-6CAC-4596-86F5-915F22803176
:END:
#+END_SRC


